Repository: miurahr/translate-django-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Once you're done looking at the patch, hit the ``q`` key to exit back to the command line.
ja: パッチを見終わったら､ ``q`` キーをタイプしたコマンドラインに戻りましょう｡

source: Once you're done modifying Django, we need to make sure that the tests we wrote earlier pass, so we can see whether the code we wrote above is working correctly.
ja: Django への変更が完了したあと､コードが正しく動作すると確認するため､先ほど書いたテストを実行してください｡

source: Once you're done with the tutorial, you can look through the rest of :doc:`Django's documentation on contributing</internals/contributing/index>`.
ja: チュートリアルを終えたら、次は :doc:`Django への貢献</internals/contributing/index>` を参照してください。

source: Once you're familiar with contributing to Django, you can move on to writing patches for more difficult and complicated tickets.
ja: Django への貢献に慣れてきたあとは､難しく､複雑なチケットを書き始めれるでしょう｡

source: Once you're in the shell, explore the :doc:`database API </topics/db/queries>`::
ja: シェルに入ったら :doc:`データベース API </topics/db/queries>` の世界を探検してみましょう::

source: Once you've looked through some of that information, you'll be ready to go out and find a ticket of your own to write a patch for.
ja: ドキュメントをたくさん読んだ後は､実際のパッチを書けるのでチケットを探してみましょう｡

source: Once you've verified that your patch and your test are working correctly, it's a good idea to run the entire Django test suite just to verify that your change hasn't introduced any bugs into other areas of Django.
ja: パッチとテストが正しく動作していることを確認できたら､ Django のテストをすべて走らせて､変更が Django の別の場所にバグを仕込んでいないか確認しましょう｡

source: Once your models are defined, Django can automatically create a professional, production ready :doc:`administrative interface </ref/contrib/admin/index>` -- a Web site that lets authenticated users add, change and delete objects.
ja: モデルの定義ができたら、Djangoは、自動的にプロレベルの、商用利用可能な、許可されたユーザがオブジェクトの追加、変更、削除を行えるWebサイトである :doc:`管理インターフェース </ref/contrib/admin/index>` を自動的に作成します。

source: One typical workflow in creating Django apps is to create models and get the admin sites up and running as fast as possible, so your staff (or clients) can start populating data.
ja: 作者たちが Django アプリケーションを作成するときの典型的なワークフローは、 モデルを作成し、 admin サイトを組み上げてできるだけ早期に立ち上げ、スタッフ (や顧客) がデータを投入できるようにしておいてから、

source: One way to check that Django still works after you make your changes is by running Django's test suite.
ja: 変更後に Django の正常動作を確認するには Django のテストスイートを実行します。

source: Oops, good thing we wrote those tests!
ja: あぁ､テストを書いていて良かったですね｡

source: Or an exception.
ja: あるいは例外です。

source: Or to Web development in general?
ja: もしくは Web 開発全般で?

source: Our poll application is not very complex and doesn't need custom admin templates.
ja: 投票アプリケーションはそれほど複雑ではないので、カスタムのアドミンテンプレートは必要ないでしょう。

source: Packaging your app
ja: アプリケーションをパッケージングする

source: Pay special attention to tickets with the "easy pickings" criterion.
ja: "easy picking" タグが付いたチケットを見つけてください｡

source: Philosophy
ja: 設計哲学

source: Playing with the API
ja: API で遊んでみる

source: Projects vs. apps
ja: プロジェクトとアプリケーション

source: Publishing your app
ja: アプリを公開する

source: Put the following code in that stylesheet (``polls/static/polls/style.css``):
ja: スタイルシートに次のコードを配置します (``polls/static/polls/style.css``):

source: Put your code in some directory **outside** of the document root, such as :file:`/home/mycode`.
ja: コードはドキュメントルートの外､例えば ``/home/mycode`` の ような場所に置きましょう。

source: Python includes a lightweight database called SQLite_ so you won't need to set up a database just yet.
ja: Pythonは軽量なデータベースであるSQLite_ を備えていますので、データベースをいますぐに設定する必要がありません。

source: Question "detail" page -- displays a question text, with no results but with a form to vote.
ja: 質問 "詳細" ページ -- 結果を表示せず、質問テキストと投票フォームを表示

source: Question "index" page -- displays the latest few questions.
ja: 質問 "インデックス" ページ -- 最新の質問をいくつか表示

source: Question "results" page -- displays results for a particular question.
ja: 質問 "結果" ページ -- 特定の質問の結果を表示

source: Quick install guide
ja: クイックインストールガイド

source: Re-run the tests and everything should pass.
ja: 再実行すればテストがすべてパスするはずです｡

source: Recall from Tutorial 1 that you start the development server like so:
ja: チュートリアルその 1 で、開発サーバを以下のように起動したのを思い出してください:

source: Remember that we haven't actually made any modifications to ``AdminURLFieldWidget`` yet, so our tests are going to fail.
ja: ``AdminURLFieldWidget`` にはまだ変更を加えていませんので､テストは落ちます｡

source: Remember, in :doc:`Tutorial 3 </intro/tutorial03>`, we created a URLconf for the polls application that includes this line:
ja: :doc:`チュートリアルその 3 </intro/tutorial03>` で、以下のような投票アプリケーションの URLconf を作成したことを思い出しましょう:

source: Remove any old versions of Django
ja: 古いバージョンの Django を削除する

source: Reusability matters
ja: 再利用性の問題

source: Reviewing existing patches is also a very helpful contribution.
ja: 既存のパッチをレビューすることをまた素晴らしく役に立つ貢献です。

source: Rolling back to a previous revision of Django
ja: 旧リビジョンの Django に戻す

source: Run the following command:
ja: 次のコマンドに従ってください：

source: Running Django's test suite for the first time
ja: 最初に Django のテストスイートを実行する

source: Running Django's test suite for the second time
ja: Django の テストスイートをもう一度走らせる

source: Running Django's test suite.
ja: Django のテストスイートの実行

source: Running your new test
ja: 新しいテストを走らせる

source: Save -- Saves changes and returns to the change-list page for this type of object.
ja: 保存 (Save) – 変更を保存して、このモデルのチェンジリストのページに戻ります。

source: Save and add another -- Saves changes and loads a new, blank form for this type of object.
ja: 保存してもう一つ追加 (Save and add another) – 変更を保存して、このモデルのオブジェクトを新規追加するための空の編集ページをロードします。

source: Save and continue editing -- Saves changes and reloads the admin page for this object.
ja: 保存して編集を続ける (Save and continue editing) – 変更を保存して、このオブジェクトの編集ページをリロードします。

source: Save these changes and start a new Python interactive shell by running ``python manage.py shell`` again::
ja: 変更を保存して、もう一度 ``python manage.py shell`` を実行して新しい Python 対話シェルを始めましょう::

source: Security fixes
ja: セキュリティ修正

source: See :doc:`/howto/jython` for details.
ja: 詳細は :doc:`/howto/jython` を見てください。

source: See :doc:`/internals/contributing/triaging-tickets` for details.
ja: 詳細は :doc:`/internals/contributing/triaging-tickets` を参照してください。

source: See :doc:`How to install Django </topics/install>` for advice on how to remove older versions of Django and install a newer one.
ja: :doc:`Django のインストール方法 </topics/install>` を見て、 Django の旧バージョンを削除してより新しいものをインストールしてください。

source: See :ref:`faq-python-version-support` for details.
ja: 詳細は :doc:`/internals/contributing/triaging-tickets` を参照してください。

source: See :ref:`running-unit-tests` for more information.
ja: :ref:`running-unit-tests` で､よりテストについて知られます｡

source: Set up a database
ja: データベースを設定する

source: Since polls are in their own URLconf (``polls/urls.py``), they can be placed under "/polls/", or under "/fun_polls/", or under "/content/polls/", or any other path root, and the app will still work.
ja: polls には独自の URLconf (``polls/urls.py``) を持っているので、 "/polls/" 、 "/fun_polls/" や、 "/content/polls/" といった、どんなパスルート下にも置けて、どこに置いてもきちんと動作します。

source: Since we never committed our changes locally, perform the following to get your git branch back to a good starting point::
ja: 変更をローカルでコミットしなかった場合は､ git のブランチを始めに戻すために以下を実行してください::

source: Since we're creating a POST form (which can have the effect of modifying data), we need to worry about Cross Site Request Forgeries.
ja: POST フォーム(データを改ざんされる恐れのある) を作成しているので、クロス サイトリクエストフォージェリを心配する必要があります。

source: Since you haven't yet made any changes to Django's code, the entire test suite **should** pass.
ja: まだ Django のコードに変更を加えていなければ､テストは全て **パスするはずです** ｡

source: Site managers use the system to add news stories, events, sports scores, etc., and that content is displayed on the public site.
ja: サイト管理者は新たな話題やイベント、 スポーツのスコアなどの入力にシステムを使い、コンテンツは公開用サイト上で表示されます。

source: Skipped tests are typically due to missing external libraries required to run the test; see :ref:`running-unit-tests-dependencies` for a list of dependencies and be sure to install any for tests related to the changes you are making (we won't need any for this tutorial).
ja: スキップされたテストは、テストを実行するために必要な外部ライブラリがインストールされていないことが原因です; 依存については :ref:`running-unit-tests-dependencies` を参照し、関連するテストを実行してください (このチュートリアルでは必要ありません)。

source: So what do I do next?
ja: 次はどうしましょうか?

source: So why create tests, and why now?
ja: どうしてテストを作るのか？また、なぜ今なのか？

source: Some :class:`~django.db.models.Field` classes have required arguments.
ja: :class:`~django.db.models.Field` クラスの中には必須の引数を持つものがありま す。

source: Specifically, we'll be covering the following:
ja: 具体的な範囲は以下の通りです:

source: Stable APIs
ja: 安定なAPI

source: Start the development server
ja: 開発サーバーの起動

source: Static file namespacing
ja: 静的ファイルの名前空間

source: Take a look in your browser, at "/polls/34/".
ja: お使いのブラウザで、 "/polls/34/" を見てください。

source: Testing your patch.
ja: パッチをテスト

source: Tests are simple routines that check the operation of your code.
ja: テストとは単純なプログラムで、あなたのコードの動作を確認します。

source: Tests will save you time
ja: テストはあなたの時間を節約します

source: Thankfully, you don't have to worry too hard, because Django comes with a very easy-to-use system for protecting against it.
ja: ありがたいことに、 Django がこれに対応するとても使いやすい仕組みを提供してくれているので、あまり心配する必要はありません。

source: That adds a "Filter" sidebar that lets people filter the change list by the ``pub_date`` field:
ja: これで、「フィルタ (Filter)」サイドバーができ、チェンジリストを ``pub_date`` フィールドの値に従ってフィルタできるようになります:

source: That means, when somebody selects one of the radio buttons and submits the form, it'll send the POST data ``choice=#`` where # is the ID of the selected choice.
ja: 投票者がラジオボタンの1つを選択し、フォームを送信する場合には、POSTデータ ``choice=#`` を送信します。＃の場所には選択肢のIDが入ります。

source: That page also includes an explanation of how to build a copy of the documentation locally, so you can preview the HTML that will be generated.
ja: ここには､ ドキュメントのコピーをローカルでビルドしてみて､ HTML をプレビューする方法なども書かれています｡

source: That phrase flags features that are only available in development versions of Django, and they likely won't work with an official release.
ja: このフレーズは Django の開発版でのみ利用可能な機能であると意味しており、公式リリースではおそらく動作しません。

source: That variable contains every installed Django app.
ja: この変数はインストールされた全 Django アプリを含んでいます。

source: That way, you could include the polls application in any new project and be assured that it would find the custom templates it needed.
ja: それにより、投票アプリケーションを他のどの新しいプロジェクトに追加できます。のアプリが必要としているカスタムテンプレートを見つけることも見つけることもできます。

source: That'll create a directory :file:`polls`, which is laid out like this::
ja: このコマンドは :file:`polls` というディレクトリを作成します。中身はこのようになっています::

source: That's it -- you can now :doc:`move onto the tutorial </intro/tutorial01>`.
ja: これだけです。 `チュートリアルに進みましょう </intro/tutorial01>` 。

source: That's it!
ja: これだけです!

source: That's not good for security.
ja: これは安全上良くありません。

source: That's used not only in the database schema, but in validation, as we'll soon see.
ja: この引数はデータベーススキーマで使われる他、後で述べるバリデーションでも使われま す。

source: That's what ``django.contrib.staticfiles`` is for: it collects static files from each of your applications (and any other places you specify) into a single location that can easily be served in production.
ja: ``django.contrib.staticfiles`` はまさにそのためにあります。これは静的なファイ ルを各アプリケーションから (さらに指定した別の場所からも) 一つの場所に集め、運用環境で公開しやすくするものです。

source: That's what the ``{% extends "base.html" %}`` does.
ja: ``{% extends "base.html" %}``の部分が行っていることです。

source: The "Add choice" form looks like this:
ja: 「Choice の追加」フォーム は以下のようになります::

source: The :djadmin:`migrate` command looks at all your available models and creates tables in your database for whichever tables don't already exist, as well as optionally providing :doc:`much richer schema control </topics/migrations>`.
ja: :djadmin:`migrate`コマンドは、定義されている全てのモデルを調べて、必要とあらばデータベースにテーブルを作成し、さらには :doc:`much richer schema control </topics/migrations>`を提供もしてくれます。

source: The :doc:`data-model syntax </topics/db/models>` offers many rich ways of representing your models -- so far, it's been solving many years' worth of database-schema problems.
ja: :doc:`データモデルの文法 </topics/db/models>` は、豊富なモデルの表現方法を提供し、これまでのところ、長年にわたるデータベース・スキーマの問題を解決してくれます。

source: The API is created on the fly, no code generation necessary:
ja: API はオンザフライで生成され、コードを作 成する必要はありません:

source: The Django admin site is activated by default.
ja: Djangoの管理サイトは、既定で有効になっています。

source: The ``name`` of each radio button is ``"choice"``.
ja: 各ラジオボタンの ``name`` は ``"choice"`` です。

source: The ``question_id='34'`` part comes from ``(?P<question_id>[0-9]+)``.
ja: ``question_id='34'`` の部分は、 ``(?P<question_id>[0-9]+)`` から来ています。

source: The ``value`` of each radio button is the associated question choice's ID.
ja: 各ラジオボタンの ``value`` は、関連する質問の選択肢のIDです。

source: The above template displays a radio button for each question choice.
ja: 上のテンプレートは、各質問の選択肢のラジオボタンが表示されます。

source: The admin isn't intended to be used by site visitors.
ja: admin はサイトの訪問者でなく、サイト管理者に使われることを意図しています。

source: The bottom part of the page gives you a couple of options:
ja: ページの末尾の部分には操作ボタンがいくつか表示されています:

source: The code above loads the ``news/year_archive.html`` template.
ja: 上のコードでは ``news/article_detail.html`` という名前のテンプレートをロー ドしています。

source: The code above maps URLs, as simple `regular expressions`_, to the location of Python callback functions ("views").
ja: 上のコードはシンプルな `正規表現`_ と Python のコールバック関数("ビュー")をマッピングしています。

source: The default is to display 100 items per page.
ja: 既定では、一ページあたり１００アイテムが表示されます。

source: The development server
ja: 開発用サーバー

source: The different model field types (:class:`~django.db.models.DateTimeField`, :class:`~django.db.models.CharField`) correspond to the appropriate HTML input widget.
ja: モデルのフィールドの型 (:class:`~django.db.models.DateTimeField` 、 :class:`~django.db.models.CharField` など) によって適切な HTML 入力ウィジェッ トが対応しています。

source: The final step is to enter your password.
ja: 最後のステップは、パスワードの入力です。

source: The first step in writing a database Web app in Django is to define your models -- essentially, your database layout, with additional metadata.
ja: Django でデータベース Web アプリケーションを書くための最初のステップは、モ デルの定義です。本質的にはデータベースのレイアウトと、追加のメタデータの定義です。

source: The first step to contributing to Django is to get a copy of the source code.
ja: Django への貢献の第一歩はソースコードの複製の取得から始まります。

source: The goal of this document is to give you enough technical specifics to understand how Django works, but this isn't intended to be a tutorial or reference -- but we've got both!
ja: このドキュメントの目的は、 Django の技術的な仕様について述べ、どのように動 作するかを理解してもらうことにあり、チュートリアルやリファレンス用ではあり ません。

source: The idea behind :func:`~django.conf.urls.include` is to make it easy to plug-and-play URLs.
ja: :func:`~django.conf.urls.include` の背景にある考えは、 URL のプラグ & プレイを簡単に作ることです。

source: The new tests check to see that the ``render`` method we'll be adding works correctly in a couple different situations.
ja: 新しいテストでは ``render`` メソッドをチェックするもので､いくつかのシチュエーションで正しく動作することを確認します｡

source: The patch for this ticket was written by Ulrich Petri, and it was applied to Django as `commit ac2052ebc84c45709ab5f0f25e685bf656ce79bc`__.
ja: このチケットのパッチは Ulrich Petri 氏により書かれ、これは `commit ac2052ebc84c45709ab5f0f25e685bf656ce79bc`__ で Django に適用されました。

source: The philosophy here is that your site is edited by a staff, or a client, or maybe just you -- and you don't want to have to deal with creating backend interfaces just to manage content.
ja: サイトの編集はスタッフ、顧客、もしくはあなた自身の手で行われるものであり、 コンテンツの管理だけのためにバックエンドインタフェースを作りたくはない、という思想がここにはあります。

source: The regular expressions use parenthesis to "capture" values from the URLs.
ja: 正規表現は、 URL から値を取得するために括弧を用います。

source: The rest is up to you.
ja: それ以外の処理はユーザ次第です。

source: The template to customize is ``admin/index.html``.
ja: カスタマイズ対象のテンプレートは "admin/index.html" です。

source: The term "regex" is a commonly used short form meaning "regular expression", which is a syntax for matching patterns in strings, or in this case, url patterns.
ja: "regex" という単語は省略形で、一般的に "regular expression" という意味があります。これは文字列にマッチするパターンの構文で、この場合はURLパターンにあたります。

source: Then at the Python prompt, try to import Django:
ja: Python プロンプトから Django をインポートします:

source: Then click "Save and continue editing." Then click "History" in the upper right.
ja: 変更したら、「保存して編集を続ける」を押します。次に、右上に ある「履歴 (History)」をクリックしてみましょう。

source: Then, Django will strip off the matching text (``"polls/"``) and send the remaining text -- ``"34/"`` -- to the 'polls.urls' URLconf for further processing which matches ``r'^(?P<question_id>[0-9]+)/$'`` resulting in a call to the ``detail()`` view like so::
ja: Django はマッチ部分のテキスト (``"polls/"``) を取り去り、残りのテキスト ``"34/"`` を 'polls.urls' という URLconf に送り、``r'^(?P<question_id>[0-9]+)/$'`` にマッチする処理をさらに行い、``detail()`` ビューが呼ばれます::

source: Then, develop the way data is presented to the public.
ja: データを公開するための方法を開発してゆくというものです。

source: These applications are included by default as a convenience for the common case.
ja: これらの機能はよく使われるのでデフォルトで付属しています。

source: These files are:
ja: ファイルはそれぞれ以下のような役割を持っています::

source: These tickets are often much simpler in nature and are great for first time contributors.
ja: このチケットは大抵はより簡単なものなので､初めての貢献者には適切でしょう｡

source: These views are slightly different, because they take an argument:
ja: これから追加するviewでは引数をとります。

source: They also can do dictionary-key lookup, index lookup and function calls.
ja: 辞書のキー参照や、インデックス参照、関数呼び出しにも使われます。

source: They too should fail when the new feature is not present, and then pass once it has been implemented.
ja: その際も同じように､新機能が無い際には落ち､実装されてから通るテストを書くべきです｡

source: They're super fast (as long as the lookups aren't too complex as noted above).
ja: 高速に動作します (先ほど述べたように複雑すぎない場合)。

source: Things to note here:
ja: 以下の点に注意してください:

source: This code includes a few things we haven't covered yet in this tutorial:
ja: このコードには、これまでのチュートリアルで扱っていなかったことがいくつか入っています:

source: This directory structure will house the poll application.
ja: このディレクトリ構造が、 poll アプリケーションの全体像です。

source: This example uses Django's :doc:`template system </topics/templates>`, which has several powerful features but strives to stay simple enough for non-programmers to use.
ja: この例では Django の :doc:`テンプレートシステム </topics/templates>` を使っ ています。テンプレートシステムは、強力な機能をいくつも備えながらも、非プロ グラマが使いこなせる程度に簡単な仕組みです。

source: This image shows an added slot:
ja: この画像は追加されたスロットのみで有効です。

source: This instructs Python to look for Django in the parent directory of ``tests``.
ja: これは Python が Django を見に行く際に ``tests`` の親ディレクトリを見に行くようにします。

source: This is a great option to isolate your development copy of Django from the rest of your system and avoids potential package conflicts.
ja: これにより Django の開発用の複製を他のシステムから分離できるため、パッケージの依存問題から開放されます。

source: This is a new feature, so it should be documented.
ja: この機能は新しいので､ドキュメントに書かれるべきです｡

source: This is called a template filter, and it's a way to filter the value of a variable.
ja: これはテンプレートフィルターと呼ばれ、変数の値にフィルターをかけるためのものです。

source: This is just the surface
ja: これらはほんの一部にすぎません

source: This is the basic concept of HTML forms.
ja: これは、HTMLフォームの基本的な概念です。

source: This is the best approach for most users.
ja: これが、ほとんどのユーザにとって最適な方法です。

source: This is the quickest option for those who have operating systems that distribute Django.
ja: Django を配布している OS を使っている人には最速の方法です。

source: This isn't impressive with only two fields, but for admin forms with dozens of fields, choosing an intuitive order is an important usability detail.
ja: 二つしかフィールドがないので、あまりぱっとした変化ではありませんね。しかし admin フォームで何ダースものフィールドを操作するような場合には、直感的なフィー ルドの並び順というものはユーザビリティ上重要な要素です。

source: This may seem daunting at first, but it's really pretty simple.
ja: 最初は気が重いかもしれませんが、実際はとても簡単です。

source: This means you should be comfortable going through the existing tutorials on :doc:`writing your first Django app</intro/tutorial01>`.
ja: つまりチュートリアル :doc:`初めての Django アプリ</intro/tutorial01>` を十分に理解していることを想定しています。

source: This option is for enthusiasts who want the latest-and-greatest features and aren't afraid of running brand new code.
ja: 最新最高の機能が使いたくて、最新コードの実行に不安のない愛好家なら、こちらの方法です。

source: This particular change above makes the "Publication date" come before the "Question" field:
ja: 上の例では、「Publication date」フィールドの表示位置を「Question」フィールドよりも前に変更しています:

source: This patch file contains all your changes and should look this:
ja: このパッチは変更のすべてを含んでおり､このようになります:

source: This powerful feature allows you to make global changes to the url patterns of your project while only touching a single file.
ja: とくにテンプレートで有効です。この便利な機能のおかげで、プロジェクトのURLにグローバルな変更を加える場合にも1つのファイルを変更するだけで済むようになります。

source: This step is only necessary if you'd like to work with a "large" database engine like PostgreSQL, MySQL, or Oracle.
ja: このステップはあなたが "大きな" データベースエンジン、 PostgreSQL 、 MySQL や Oracle を使っている場合に必要です。

source: This style of development is called `test-driven development`__ and can be applied to both entire projects and single patches.
ja: この開発手法は `テスト駆動開発`__ と呼ばれ､プロジェクト全体にも単一のパッチにも適応可能です｡

source: This tells Django what type of data each field holds.
ja: こうしたクラスは、各フィールドにどのようなデータ型を記憶させるか を Django に教えます。

source: This tip isn't specific to Django; it's just good Web development practice.
ja: これは、 Django 固有のものではなく、いわば Web 開発の王道です。

source: This tutorial begins where :doc:`Tutorial 3 </intro/tutorial03>` left off.
ja: このチュートリアルは :doc:`チュートリアル 3 </intro/tutorial03>`の続きです。

source: This tutorial begins where :doc:`Tutorial 5 </intro/tutorial05>` left off.
ja: このチュートリアルは :doc:`チュートリアル ５ </intro/tutorial05>`の続きです。

source: This tutorial provides basic instruction in the use of URLconfs, and you can refer to :mod:`django.core.urlresolvers` for more information.
ja: このチュートリアルでは基本的な URLconf の使い方を紹介します。詳細については :mod:`django.core.urlresolvers` を参照してください。

source: This will allow us to go through all of the steps involved in writing that patch from scratch, including running Django's test suite.
ja: これによりスクラッチからパッチの作成、 Django のテストスイートの実行を含む全ての手順を解説します。

source: This will display the differences between your current copy of Django (with your changes) and the revision that you initially checked out earlier in the tutorial.
ja: チュートリアルの初めでチェックアウトした最初のリビジョンと､(修正した) 現在の Django のコピーとの違いを表示します｡

source: Those of you who are unfamiliar with version control systems and Trac will find that this tutorial and its links include just enough information to get started.
ja: バージョン管理システムと Trac をよく知らない方でも、このチュートリアルとリンク先から、始めるに十分な情報を得ることができます。

source: Throughout this tutorial, we'll walk you through the creation of a basic poll application.
ja: このチュートリアルでは、簡単な投票 (poll) アプリケーションの作成に取り組ん でもらいます。

source: Ticket :ticket:`17549` describes the following, small feature addition:
ja: チケット :ticket:`17549` は以下の軽微な機能追加をするものです:

source: To check whether or not you have Git installed, enter ``git`` into the command line.
ja: Gitがインストールサれているかどうかわからない場合は、 ``git`` をコマンドラインに入れてみましょう。

source: To create your app, make sure you're in the same directory as :file:`manage.py` and type this command:
ja: アプリケーションを作るには、 :file:`manage.py` と同じディレクトリに入って、このコマンドを実行します:

source: To design URLs for an app, you create a Python module called a :doc:`URLconf </topics/http/urls>`.
ja: 特定のアプリケーション用の URL を設計するには、 `URLconf </topics/http/urls>` と呼ばれる Python モジュールを一つ作成します。

source: To get a look at the content of your patch, run the following command::
ja: パッチの内容を見るために､以下のコマンドを実行してください::

source: To install such a database, consult the :ref:`database installation information <database-installation>`.
ja: これらのデータベースをインストールするには、 :ref:`データベースのインストール方法 <database-installation>` を参照してください。

source: To run the entire Django test suite, ``cd`` into the Django ``tests/`` directory and run::
ja: Django の全てのテストスイートを走らせるには ``cd`` で Django の ``tests/`` ディレクトリ移動して実行してください::

source: To run the tests in the ``admin_widgets`` folder, ``cd`` into the Django ``tests/`` directory and run::
ja: Djangoの ``admin_widgets`` フォルダーに ``cd`` で移動して､以下を実行してください::

source: To verify that Django can be seen by Python, type ``python`` from your shell.
ja: Djnago が Python から見れるか確認をするには、シェルで ``python`` とタイプして、
